Repository: aimeos/ai-admin-extadm
Catalog: controller/extjs/i18n/*.po
Languages: pt_br

source: Changing file permissions for "%1$s" to "%2$o" failed
pt_br: A alteração das permissões de arquivo de "%1$s" para "%2$o" falhou

source: Class "%1$s" does not implement "%2$s"
pt_br: A classe "%1$s" não implementa "%2$s"

source: Class "%1$s" not found
pt_br: Classe "%1$s" não encontrada

source: Controller path is empty
pt_br: Caminho do controlador está vazio

source: Could not set permissions "%1$s" for file "%2$s"
pt_br: Não foi possível atribuir as permissões "%1$s" para o arquivo "%2$s"

source: Couldn't create directory "%1$s" with permissions "%2$o"
pt_br: Não foi possível criar o diretório "%1$s" com as permissões "%2$o"

source: Create export directory for attribute IDs: %1$s
pt_br: Criar diretórios de exportação para os IDs do atributo: %1$s

source: Create export directory for catalog IDs: %1$s
pt_br: Criar diretórios de exportação para os IDs do catálogo: %1$s

source: Create export directory for product IDs: %1$s
pt_br: Criar diretórios de exportação para os IDs do produto: %1$s

source: Deleting file "%1$s" failed
pt_br: Falha ao remover o arquivo "%1$s"

source: Download
pt_br: Baixar

source: Error in %1$s text import: %2$s
pt_br: Erro na importação do texto %1$s: %2$s

source: Factory "%1$s" not found
pt_br: Fábrica "%1$s" não encontrada

source: File "%1$s" was not uploaded
pt_br: Arquivo "%1$s" não foi enviado

source: Invalid class name "%1$s"
pt_br: Nome de classe inválido "%1$s"

source: Invalid controller "%1$s" in "%2$s"
pt_br: Controlador inválido "%1$s" em "%2$s"

source: Invalid controller factory name "%1$s"
pt_br: Nome inválido da fábrica do controlador "%1$s"

source: Invalid domain "%1$s"
pt_br: Domínio "%1$s" inválido

source: Invalid factory "%1$s"
pt_br: Fábrica inválida "%1$s"

source: Invalid list type "%1$s"
pt_br: Tipo de lista inválido "%1$s"

source: Invalid method "%1$s" in request
pt_br: Método "%1$s" inválido na requisição

source: Invalid row from %1$s text import: %2$s
pt_br: Linha inválida na importação do texto %1$s: %2$s

source: Invalid sort direction "%1$s"
pt_br: Direção de ordenamento inválida "%1$s"

source: Invalid text type "%1$s"
pt_br: Tipo de texto "%1$s"inválido

source: List item doesn't implement "%1$s"
pt_br: Item da lista não implementa "%1$s"

source: Method "%1$s" not found
pt_br: Método "%1$s" não encontrado

source: Missing parameter "%1$s"
pt_br: Parâmetro "%1$s" faltando

source: No allowed image types configured for "%1$s"
pt_br: Não existem tipos de imagens permitidos para "%1$s"

source: Required attribute "%1$s" missing in request
pt_br: Atributo obrigatório "%1$s" faltando no pedido

source: Site item for code "%1$s" not found
pt_br: Item do site com o código "%1$s" não encontrado

source: Unable to call method "%1$s"
pt_br: Incapaz de chamar o método "%1$s"

source: Unable to create directory "%1$s"
pt_br: Incapaz de criar o diretório "%1$s"

source: Unable to create file in "%1$s"
pt_br: Incapaz de criar o arquivo em "%1$s"

source: Uploaded file could not be moved to upload directory "%1$s"
pt_br: Arquivo enviado não pôde ser movido para o diretório de uploads "%1$s"
